000101220118       //***********************************************************************
000102220118       //
000103220118       //***********************************************************************
000104220118       ctl-opt nomain;
000105220118       ctl-opt thread(*SERIALIZE);
000107220118       //-----------------------------------------------
000108220118       //
000109220118       //
000110220118       //
000111220118       //-----------------------------------------------
000112220118       dcl-proc RamdomPass Export;
000113220118         dcl-pi *N  varchar(250) ;
000115220118         end-pi;
000116220118       //-----------------------------------------------
000117220118       // Returned field declaration for Java method:
000118220118       //     Genkey in class passGen
000119220118       //     Java returned type is java.lang.String
000120220118       //-----------------------------------------------
000121220118       Dcl-S GenkeyRet OBJECT(*JAVA : 'java.lang.String' );
000124220118       //------------------------------------------
000125220118       // Prototype for Java method:
000126220118       //     Genkey in class passGen in package
000127220118       //------------------------------------------
000128220118       Dcl-Pr Genkey OBJECT(*JAVA : 'java.lang.String' )
000129220118          EXTPROC(*JAVA : 'passGen' : 'Genkey' ) STATIC;
000131220118       End-Pr ;
000132220118       //----------------------------------------------------------------------
000133220118       //
000134220118       //----------------------------------------------------------------------
000135220118       //dcl-pr JAVA_toString like(JAVA_String)
000136220118       //                extproc( *JAVA :'java.lang.String':
000137220118       //                *constructor );
000138220118       //   value varchar( 65535 ) const;
000139220118       //end-pr;
000140220118       //----------------------------------------------------------------------
000141220118       //
000142220118       //----------------------------------------------------------------------
000143220118       dcl-pr getBytes char(250) extproc(*java:'java.lang.String':'getBytes');
000144220118
000145220118       end-pr;
000146220118
000147220118       //----------------------------------------------------------------------
000148220118       //
000149220118       //----------------------------------------------------------------------
000150220118       dcl-s RamVal  varchar(250);
000151220118       dcl-s Pass8   varchar(08);
000152220118
000153220118       //-------------------------------
000154220118       //
000155220118       //
000156220118       //-------------------------------
000157220118        GenkeyRet = Genkey();
000158220118        RamVal    = getBytes(GenKeyRet);
000159220118        pass8     = %trim(RamVal);
000160220118        return    pass8;
000161220118       end-proc;
000162220118
000163220118
000190220118
