000100220120             PGM
000200200422             DCL        VAR(&PROG) TYPE(*CHAR) LEN(10)
000300220120             DCL        VAR(&LIBNAM) TYPE(*CHAR) LEN(10) +
000400220120                        VALUE('BACUSRLIB')
000500211025             DCL        VAR(&LIBOBJ) TYPE(*CHAR) LEN(10) +
000600220120                        VALUE('BACUSRLIB')
000700200422             DCL        VAR(&BACNM) TYPE(*CHAR) LEN(8)
000800200422
000900200422             RTVNETA    SYSNAME(&BACNM)
001000200422             IF         COND(&BACNM *EQ 'BAC03') THEN(CHGVAR +
001100220120                        VAR(&LIBNAM) VALUE('BACDEVLIB'))
001200200422
001300200422             ADDLIBLE   LIB(QMQM)
001400200422             MONMSG     MSGID(CPF2103)
001500200422
001600211023         /* Programas Auxiliares para la conversion de Caracteres*/
001700211023
001800211023
001900211206             DLTMOD     MODULE(&LIBOBJ/BA51007090)
002000211023             MONMSG     MSGID(CPF0000)
002100211206             DLTPGM     PGM(&LIBOBJ/BA51007090)
002200211206             MONMSG     MSGID(CPF0000)
002201220120             DLTMOD     MODULE(&LIBOBJ/BA51007091)
002202220120             MONMSG     MSGID(CPF0000)
002203220120             DLTPGM     PGM(&LIBOBJ/BA51007091)
002204220120             MONMSG     MSGID(CPF0000)
002300211206             DLTMOD     MODULE(&LIBOBJ/BA51007098)
002400211206             MONMSG     MSGID(CPF0000)
002500220120             DLTSRVPGM  SRVPGM(&LIBOBJ/BA51007098)
002600211023             MONMSG     MSGID(CPF0000)
002700211023
002800211023
002900211023         /* Programas Auxiliares para la conversion de Caracteres*/
003000211023
003100211023
003101220121             CHKOBJ     OBJ(BACCYFILES/PFDTAKEY) OBJTYPE(*FILE)
003102220120             MONMSG     MSGID(CPF9801) EXEC( +
003103220121             CRTPF      FILE(BACCYFILES/PFDTAKEY)  +
003104220120                        SRCFILE(&LIBNAM/QDDSRC)  +
003105220120                        SRCMBR(PFDTAKEY) IGCDTA(*N) +
003106220120                        REUSEDLT(*YES) )
003107220120
003200211023
003300211023         /* Creacion de Programa de Servicio , para Encriptacion */
003400211023
003500211206             CRTRPGMOD MODULE(BACUSRLIB/BA51007098) +
003600220120                       SRCFILE(&LIBNAM/QRPGSRC)      +
003700211206                       SRCMBR(BA51007098)           +
003800211023                       DBGVIEW(*SOURCE)             +
003900211023                       REPLACE(*YES)                +
004000211023                       AUT(*ALL)
004100211023
004200211023
004300211206             CRTSRVPGM SRVPGM(BACUSRLIB/BA51007098) +
004400211206                       MODULE(BACUSRLIB/BA51007098) +
004500211023                       EXPORT(*ALL)
004600211023
004700211023
004800220120             CRTRPGMOD  MODULE(BACUSRLIB/BA51007090) +
004900220120                          SRCFILE(&LIBNAM/QRPGSRC) DBGVIEW(*ALL) +
005000211206                          AUT(*ALL)
005100211206
005200211023
005300220120             CRTPGM     PGM(BACUSRLIB/BA51007090) +
005400220120                         MODULE(BACUSRLIB/BA51007090 BYPUTMSG) +
005500220120                         ENTMOD(*PGM) BNDSRVPGM((QMQM/LIBMQM) +
005600220120                         (BACUSRLIB/BA51007098))
005601220120
005602220120      /* Get-CVV Modification                      */
005603220120             CRTRPGMOD  MODULE(BACUSRLIB/BA51007091) +
005604220120                          SRCFILE(&LIBNAM/QRPGSRC) DBGVIEW(*ALL) +
005605220120                          AUT(*ALL)
005606220120
005607220120             CRTPGM     PGM(BACUSRLIB/BA51007091) +
005608220120                          MODULE(BACUSRLIB/BA51007091 BYPUTMSG) +
005609220120                          ENTMOD(*PGM) BNDSRVPGM((QMQM/LIBMQM))
005700050907
005746220120
005800200422             ENDPGM
