000100200422             PGM        PARM(&PROG)
000200200422             DCL        VAR(&PROG) TYPE(*CHAR) LEN(10)
000300200422             DCL        VAR(&LIBNM) TYPE(*CHAR) LEN(10) +
000400200422                          VALUE('BACUSRLIB')
000500211025             DCL        VAR(&LIBOBJ) TYPE(*CHAR) LEN(10) +
000600211025                          VALUE('BACUSRLIB')
000700200422             DCL        VAR(&BACNM) TYPE(*CHAR) LEN(8)
000800200422
000900200422             RTVNETA    SYSNAME(&BACNM)
001000200422             IF         COND(&BACNM *EQ 'BAC03') THEN(CHGVAR +
001100200422                          VAR(&LIBNM) VALUE('BACDEVLIB'))
001200200422
001300200422             ADDLIBLE   LIB(QMQM)
001400200422             MONMSG     MSGID(CPF2103)
001500200422
001600211023         /* Programas Auxiliares para la conversion de Caracteres*/
001700211023
001800211023
001900211025             DLTPGM     PGM(&LIBOBJ/BA51007090)
002000211023             MONMSG     MSGID(CPF0000)
002100211025             DLTPGM     PGM(&LIBOBJ/BA51007091)
002200211023             MONMSG     MSGID(CPF0000)
002300211025             DLTPGM     PGM(&LIBOBJ/BA51007092)
002400211023             MONMSG     MSGID(CPF0000)
002500211025             DLTPGM     PGM(&LIBOBJ/BA51007093)
002600211023             MONMSG     MSGID(CPF0000)
002700211025             DLTPGM     PGM(&LIBOBJ/BA51007094)
002800211023             MONMSG     MSGID(CPF0000)
002900211025             DLTPGM     PGM(&LIBOBJ/BA51007095)
003000211023             MONMSG     MSGID(CPF0000)
003100211023
003200211023
003300211023         /* Programas Auxiliares para la conversion de Caracteres*/
003400211023
003500211025             CRTBNDRPG  PGM(BACUSRLIB/BA51007091) +
003600211025                          SRCFILE(&LIBNM/QRPGSRC) +
003700211025                          SRCMBR(BA51007091) DFTACTGRP(*NO) +
003800211025                          DBGVIEW(*ALL) REPLACE(*NO) AUT(*ALL)
003900211023
004000211023
004100211025             CRTBNDRPG PGM(BACUSRLIB/BA51007094)       +
004200211025                       SRCFILE(&LIBNM/QRPGSRC)         +
004300211025                       SRCMBR(BA51007094)              +
004400211025                         DFTACTGRP(*NO)                +
004500211025                         DBGVIEW(*ALL)                 +
004600211025                         REPLACE(*NO)                  +
004700211023                         AUT(*ALL)
004800211023
004900211025             CRTBNDRPG PGM(BACUSRLIB/BA51007095)       +
005000211025                       SRCFILE(&LIBNM/QRPGSRC)         +
005100211025                       SRCMBR(BA51007095)              +
005200211025                         DFTACTGRP(*NO)                +
005300211025                         DBGVIEW(*ALL)                 +
005400211025                         REPLACE(*NO)                  +
005500211023                         AUT(*ALL)
005600211023
005700211023
005800211023
005900211023         /* Creacion de Programa de Servicio , para Encriptacion */
006000211023
006100211023             CRTRPGMOD MODULE(BACUSRLIB/BA51007093) +
006200211023                       SRCFILE(&LIBNM/QRPGSRC)      +
006300211023                       SRCMBR(BA51007093)           +
006400211023                       DBGVIEW(*SOURCE)             +
006500211023                       REPLACE(*YES)                +
006600211023                       AUT(*ALL)
006700211023
006800211023
006900211023             CRTSRVPGM SRVPGM(BACUSRLIB/BA51007093) +
007000211023                       MODULE(BACUSRLIB/BA51007093) +
007100211023                       EXPORT(*ALL)
007200211023
007300211023
007400210902             CRTSQLRPGI OBJ(BACUSRLIB/&PROG) SRCFILE(&LIBNM/QRPGSRC) +
007500210902                          COMMIT(*NONE) OBJTYPE(*MODULE) +
007600210902                          OPTION(*SQL) DBGVIEW(*SOURCE)
007700110511
007800211023
007900211023
008000210907             CRTPGM     PGM(BACUSRLIB/&PROG) MODULE(BACUSRLIB/&PROG +
008100210907                          BYPUTMSG) ENTMOD(*PGM) +
008200210907                          BNDSRVPGM((QMQM/LIBMQM) +
008300211023                          (BACUSRLIB/BA51007093))
008400050907
008500200422             ENDPGM
